Revit 2027 API
Segment.GetSizes Method
 Gets the defined sizes of the segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<MEPSize> GetSizes()
Public Function GetSizes As ICollection(Of MEPSize)
public:
ICollection<MEPSize^>^ GetSizes()
member GetSizes : unit -> ICollection<MEPSize>
Return Value
ICollection<MEPSize>
See Also
Reference
Segment Class
Autodesk.Revit.DB Namespace